## Pandas

*pandas* is a powerful package that provides a fast, flexible, and easy paltform for data analysis. pandas object can be though of as enhanced versions of NumPy arrays that can be identified with labels. pandas provides a convenient storage interface for many different kinds of data, including tabular data with heterogeneously-typed columns and missing values, ordered or unordered time-series data, matrix data with row/column labels.

The two main data structures in pandas: 
1. *Series* (1-dimensional)
2. *Dataframe* (2-dimensional)

pandas documentation is very detailed and useful and contains a [short tutorial](https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html). You can also check this [Cheatsheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)

### Readings

Chapter 3 from Python Data Science Handbook by Jake VanderPlas

In [4]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [5]:
# First, import pandas

import pandas as pd

#### Series

_Series_ is pandas one-dimensional array of indexed data. We can make _Series_ from lists or arrays or dictionaries. _Series_ object wraps around both a sequence of __indices__ and __values__.
_Series_ are much more powerful than NumPy arrays due to the presence of index. The index can be a string or an integer.

In [6]:
# A Series object based on a list/array
data = pd.Series([1.0, 2.3, 9.6, -0.1, 4.5])
print(data)

0    1.0
1    2.3
2    9.6
3   -0.1
4    4.5
dtype: float64

In [7]:
print(data.values)
print(data.index)

[ 1.   2.3  9.6 -0.1  4.5]
RangeIndex(start=0, stop=5, step=1)

In [8]:
print(data[2:4])

2    9.6
3   -0.1
dtype: float64

In [9]:
# The index can be: int, float, string, ... 
data2 = pd.Series([1.3, 2.3, 5.9, 7.6] , index =['first','second','third', 'fourth'])
print(data2)

first     1.3
second    2.3
third     5.9
fourth    7.6
dtype: float64

In [10]:
# Series are like special dictionaries

president_heights = {'George Washington' : 189,  'John Adams' : 170,  
                     'Thomas Jefferson' :189, 'James Madison':163, 'James Monroe':183,
                     'John Quincy Adams':171 , 'Andrew Jackson' :185, 
                     'Martin Van Buren' :168 ,'William Henry Harrison' :173, 
                     'John Tyler' :183, 'James K. Polk':173, 'Zachary Taylor':173}

ph = pd.Series(president_heights )

print(ph)

George Washington         189
John Adams                170
Thomas Jefferson          189
James Madison             163
James Monroe              183
John Quincy Adams         171
Andrew Jackson            185
Martin Van Buren          168
William Henry Harrison    173
John Tyler                183
James K. Polk             173
Zachary Taylor            173
dtype: int64

In [11]:
ph['John Tyler']

183

In [12]:
ph['John Adams' : 'Andrew Jackson']

John Adams           170
Thomas Jefferson     189
James Madison        163
James Monroe         183
John Quincy Adams    171
Andrew Jackson       185
dtype: int64

#### Dataframes

_Dataframe_ is pandas two dimensional array with flexible row indices and flexible column names.

In [13]:
# Lets read in data from a csv file

dfmovies = pd.read_csv('movies_by_year.csv')

dfmovies.head(5)

   Year  Total Gross  Number of Movies                             #1 Movie
0  2015      11128.5               702         Star Wars: The Force Awakens
1  2014      10360.8               702                      American Sniper
2  2013      10923.6               688                        Catching Fire
3  2012      10837.4               667                         The Avengers
4  2011      10174.3               602  Harry Potter / Deathly Hallows (P2)

In [14]:
# read_csv reads and stores the data as a Dataframe object, with indexing and type detection 

# We can check the type of variables present in the Dataframe
dfmovies.dtypes

Year                  int64
Total Gross         float64
Number of Movies      int64
#1 Movie             object
dtype: object

In [15]:
dfmovies.shape

(36, 4)

In [16]:
dfmovies.columns

Index(['Year', 'Total Gross', 'Number of Movies', '#1 Movie'], dtype='object')

In [17]:
# Dataframe.describe() prints summary statistics

dfmovies.describe()

              Year   Total Gross  Number of Movies
count    36.000000     36.000000         36.000000
mean   1997.500000   6984.169444        504.666667
std      10.535654   2738.850447        114.518121
min    1980.000000   2749.000000        161.000000
25%    1988.750000   4717.000000        461.750000
50%    1997.500000   6657.450000        504.000000
75%    2006.250000   9443.050000        548.000000
max    2015.000000  11128.500000        702.000000

In [18]:

dfmovies['Total Gross'].min()

2749.0

In [19]:
#We can select subsets of the rows by indexing, and select specific columns by their name
dfmovies['#1 Movie'][:4]

0    Star Wars: The Force Awakens
1                 American Sniper
2                   Catching Fire
3                    The Avengers
Name: #1 Movie, dtype: object

In [20]:
# We can change the name of any column 

dfmovies.rename(columns={'#1 Movie' : 'Title'}, inplace=True)
dfmovies.rename(columns={'Total Gross' : 'Total_Gross'}, inplace=True)

dfmovies.head(5)

   Year  Total_Gross  Number of Movies                                Title
0  2015      11128.5               702         Star Wars: The Force Awakens
1  2014      10360.8               702                      American Sniper
2  2013      10923.6               688                        Catching Fire
3  2012      10837.4               667                         The Avengers
4  2011      10174.3               602  Harry Potter / Deathly Hallows (P2)

In [21]:
# We can sort based on a specific column

dfmovies.sort_values(['Total_Gross'], ascending = False).head(5)

   Year  Total_Gross  Number of Movies                         Title
0  2015      11128.5               702  Star Wars: The Force Awakens
2  2013      10923.6               688                 Catching Fire
3  2012      10837.4               667                  The Avengers
6  2009      10595.5               521                        Avatar
5  2010      10565.6               536                   Toy Story 3

In [22]:
# We can select just one column 
# The output will be a Series type

titles = dfmovies['Title']

type(titles)

pandas.core.series.Series

In [23]:
titles.head(5)

0           Star Wars: The Force Awakens
1                        American Sniper
2                          Catching Fire
3                           The Avengers
4    Harry Potter / Deathly Hallows (P2)
Name: Title, dtype: object

#### Slicing and indexing using loc and iloc

We can use either __loc__ or __iloc__ to select subsets of rows/colums. the __loc__ attribute uses explicit index which means it can work with string labels. It accepts a single label, a list (or array) of labels, or a slice of labels.

The __iloc__ attributes uses the implicit Python-style index:

In [24]:
dfmovies.loc[0:8 , 'Title']

0           Star Wars: The Force Awakens
1                        American Sniper
2                          Catching Fire
3                           The Avengers
4    Harry Potter / Deathly Hallows (P2)
5                            Toy Story 3
6                                 Avatar
7                        The Dark Knight
8                           Spider-Man 3
Name: Title, dtype: object

In [25]:
dfmovies.iloc[1:8, 3:4 ]

                                 Title
1                      American Sniper
2                        Catching Fire
3                         The Avengers
4  Harry Potter / Deathly Hallows (P2)
5                          Toy Story 3
6                               Avatar
7                      The Dark Knight

#### Filtering

We can filter a _Dataframe_ based on one or more conditions for column(s) values. 
In the example below, we are filtering to retrieve movies that were made before 1999. The second example shows adding another condition. Now we filter for movies that were made before 1999 and made more than 4500 million.

In [26]:
#Filtering

dfmovies[dfmovies.Year < 1999]

    Year  Total_Gross  Number of Movies                    Title
17  1998       6949.0               509      Saving Private Ryan
18  1997       6365.9               510                  Titanic
19  1996       5911.5               471         Independence Day
20  1995       5493.5               411                Toy Story
21  1994       5396.2               453             Forrest Gump
22  1993       5154.2               462            Jurassic Park
23  1992       4871.0               480                  Aladdin
24  1991       4803.2               458             Terminator 2
25  1990       5021.8               410               Home Alone
26  1989       5033.4               502                   Batman
27  1988       4458.4               510                 Rain Man
28  1987       4252.9               509     Three Men and a Baby
29  1986       3778.0               451                  Top Gun
30  1985       3749.2               470       Back to the Future
31  1984       4031.0               536        Beverly Hills Cop
32  1983       3766.0               495       Return of the Jedi
33  1982       3453.0               428                     E.T.
34  1981       2966.0               173       Raiders / Lost Ark
35  1980       2749.0               161  The Empire Strikes Back

In [27]:
# We can do filtering based on two columns

dfmovies[ (dfmovies.Year < 1999) & (dfmovies.Total_Gross  > 4500)]

    Year  Total_Gross  Number of Movies                Title
17  1998       6949.0               509  Saving Private Ryan
18  1997       6365.9               510              Titanic
19  1996       5911.5               471     Independence Day
20  1995       5493.5               411            Toy Story
21  1994       5396.2               453         Forrest Gump
22  1993       5154.2               462        Jurassic Park
23  1992       4871.0               480              Aladdin
24  1991       4803.2               458         Terminator 2
25  1990       5021.8               410           Home Alone
26  1989       5033.4               502               Batman

#### Filtering based on string

You can use a string function applied to a column of data to filter the data. You can also do statistics on such filtering.

In [28]:

dfmovies[dfmovies['Title'].str.contains('G')]

    Year  Total_Gross  Number of Movies         Title
15  2000       7661.0               478    The Grinch
21  1994       5396.2               453  Forrest Gump
29  1986       3778.0               451       Top Gun

In [29]:
dfmovies[dfmovies['Title'].str.contains('G')]['Total_Gross'].mean()

5611.733333333334

In [30]:
# You can also plot your data 

import matplotlib.pyplot as plt
%matplotlib inline

In [31]:
dfmovies.plot(x = 'Title', y= 'Total Gross', kind = 'bar')

KeyError: 'Total Gross'

In [ ]:
dfmovies.plot(x = 'Title', y= 'Total Gross', kind = 'barh' , figsize = (6,6))

## Exercise

Now it's your turn to do some exercises and get familiar with Python. First, you are going to answer some questions about the movies dataset we already explored:

1. Get a quick statistical profile of Total_Gross column?

In [ ]:
#Your code here

2. Get the summary statistics (mean,max,min,std) of Total_Gross for movies that were highest grossing movie of the year during 1985 - 1995

In [ ]:
#Your code here

3. Do the same thing for movies during 2005-2015 period

In [ ]:
#Your code here

What are some insights you gain from this comparison?

4. Show the relationship between Total_Gross and year by choosing a proper plot

In [ ]:
#Your code here

Let's look at  _ClassifyRisk_ dataset.

In [ ]:
df = pd.read_csv('Risk.csv')

df.head(10)

In [ ]:
df.describe()

Many datasets contain missing data. pandas isnull( ) functions allows us to determine whether our columns contain missing values or not

In [ ]:
#finding columns with missing values

df.isnull().sum()

#### Getting unique value lists and counts

We can get the unique values and their counts

In [ ]:
#unique values per column
df['NUMKIDS'].unique()

In [ ]:
# frequency of values 

df['NUMKIDS'].value_counts()

In [ ]:
#by defualt frequency is sort by value, if you want to sort by index

df['NUMKIDS'].value_counts().sort_index()

__groupby__ is a useful function for data aggregation and slicing.

In [ ]:
df.groupby('AGE')['INCOME'].mean()

In [ ]:
df.groupby('NUMKIDS')['AGE'].mean()

In [ ]:
df.groupby('MARITAL')['NUMKIDS'].describe().unstack()

## Exercise

Now it's your turn to explore Risk dataset and answer the follwoing questions:

1. Find the minimum and maximum values of income

In [ ]:
#Your code here

2. Find the mean income based on gender

3. Draw the histogram of income distribution based on gender

4. Think about the datasets at hand. Come up with some questions and try to analyze the data and answer them. If needed, draw some plots. You should explore the columns and try to find insights based on the data. 
You need to come up with 3 questions and show your anlysis.